In [1]:
## Q No.1 :
import pandas as pd

In [2]:
pd.Series([4,8,15,16,23,42])

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [3]:
## Q No. 2 :
l=[1,2,3,4,5,6,7,8,9,10]
pd.Series(l)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [21]:
## Q No. 3 :
d={'Name':["Alice","Bob","Claire"],
   'Age' :[25,30,27],
   'Gender' : ['Female','Male',"Female"]
}


df=pd.DataFrame(d)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [6]:
## Q No. 4 :
"""
A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

A Pandas Series is a 1D array of data, but a single-column DataFrame is a 2D table with one column. 
The main distinction between the two is this. For a single-column DataFrame, an index can be optional,
but a Series has to have an index defined.
"""
# example :

a=pd.Series([1,2,3,4]) 
type(a)
a.dtypes
a.ndim

1

In [7]:
#example :
df=pd.DataFrame(a)
df
df.dtypes
df.ndim

2

In [16]:
## Q No. 5 :
'''
1. Head and Tail
2. DataFrame.info( )
3. Dtypes
4. Shape and Size
5. describe( )
6. Sample
7. Identifying Missing Values Isnull
8. Isna
9. Identifying Missing Values Sum
10. Nunique
'''

'\n1. Head and Tail\n2. DataFrame.info( )\n3. Dtypes\n4. Shape and Size\n5. describe( )\n6. Sample\n7. Identifying Missing Values Isnull\n8. Isna\n9. Identifying Missing Values Sum\n10. Nunique\n'

In [17]:
df.tail()

   0
0  1
1  2
2  3
3  4

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       4 non-null      int64
dtypes: int64(1)
memory usage: 160.0 bytes

In [19]:
df.nunique()

0    4
dtype: int64

In [21]:
df.isnull().sum()

0    0
dtype: int64

In [23]:
df.isna().any()

0    False
dtype: bool

In [24]:
df.shape

(4, 1)

In [25]:
df.size

4

In [26]:
df.head()

   0
0  1
1  2
2  3
3  4

In [27]:
df.tail()

   0
0  1
1  2
2  3
3  4

In [28]:
df.describe()

              0
count  4.000000
mean   2.500000
std    1.290994
min    1.000000
25%    1.750000
50%    2.500000
75%    3.250000
max    4.000000

In [29]:
df.mean()

0    2.5
dtype: float64

In [ ]:
## Q No. 6 :
# All Pandas data structures are value mutable (can be changed) and except Series all are size mutable

In [32]:
## Q No. 7 :
s1=pd.Series([1,2,3,4,5,6,7,8])
s2=pd.Series([112,324,536,748,53,5678,87,8])
s3=pd.Series([516,27,839,40,5,66,7,98])

In [40]:
df=pd.concat([s1,s2,s3],axis=1)
df

   0     1    2
0  1   112  516
1  2   324   27
2  3   536  839
3  4   748   40
4  5    53    5
5  6  5678   66
6  7    87    7
7  8     8   98